liamsabs/ECE499-buoyancy-energy-storage-system/ece499-dspic33ck/hall-sensor-based-foc-dspic33ck256mp508-lvmc/pmsm.c
/******************************************************************************
 * Description: The calculation of six sector to equivalent angle in Q15 format.
 *              Here the angle is varying from -32768 to 32767. The 
 *****************************************************************************/
int16_t sectorToAngle[8] =  // 3, 2, 6, 4, 5, 1
{
    0,
    21845,      // sector-1 =
    -21864,     // sector-2 = (-32768+10922)
    -32768,     // sector-3
    0,          // sector-4
    10922,      // sector-5
    -10924,     //sector-6
    0
};

/******************************************************************************
 * Description: The CND Interrupt is serviced at every hall signal transition. 
 *              This enables to calculate the speed based on the time taken for
 *              360 degree electrical rotation.
 *****************************************************************************/
void __attribute__((interrupt, no_auto_psv)) HAL_MC1HallStateChangeInterrupt ()
{
     SPITrigger;//Disable SPI
    mcappData.timerValue = TMR1;
    TMR1 = 0;
//    if(mcappData.timerValue == 0)
//    {
//        mcappData.period = 1;
//    }
//    else
//    {
        mcappData.period = mcappData.timerValue;
//    }
    mcappData.sector = HAL_HallValueRead();
    // Instead of making abrupt correction to the angle corresponding to hall sector, find the error and make gentle correction 
  
    mcappData.hallThetaError = (sectorToAngle[mcappData.sector] + OFFSET_CORRECTION) - mcappData.HallTheta;
    
    // Find the correction to be done in every step
    // If "hallThetaError" is 2000, and "hallCorrectionFactor" = (2000/8) = 250
    // So the error of 2000 will be corrected in 8 steps, with each step being 250
    mcappData.hallCorrectionFactor = mcappData.hallThetaError >> HALL_CORRECTION_DIVISOR;
    mcappData.hallCorrectionCounter = HALL_CORRECTION_STEPS;
    
    if(uGF.bits.MotorState == 0b01){
        
        if(++system.position >= STORING_DONE_POS){ //increments then checks if end of storing
            
            system.state = STORED; //set state to stored
            uGF.bits.MotorState=0b11;
            /*TODO: Engage Locking Mechanism*/
            prepareTxData(); //acquire sensor and system state data
            SPITrigger = 1; //set PORTE1 high (MicroBus_A_AN)
            
            
        } 
        
    }else if (uGF.bits.MotorState == 0b10){
        
        /*if(--system.position <= GEN_DONE_POS){ //decrements then checks if end of generating
            
            system.state = IDLE; // set state to IDLE
            uGF.bits.MotorState=0b11;
            ResetParmeters(); // stop generating
            prepareTxData(); //acquire sensor and system state data
            SPITrigger = 1; //set PORTE1 high (MicroBus_A_AN)
            
        }*/
    }
    HAL_MC1HallStateChangeInterruptFlagClear();
}
// *****************************************************************************
/* Function:
   _ADCInterrupt()

  Summary:
   _ADCInterrupt() ISR routine

  Description:
    Does speed calculation and executes the vector update loop
    The ADC sample and conversion is triggered by the PWM period.
    The speed calculation assumes a fixed time interval between calculations.

  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void __attribute__((__interrupt__,no_auto_psv)) _ADCInterrupt()
{
    SPITrigger=0;//Disable SPI
#ifdef SINGLE_SHUNT 
    if (IFS4bits.PWM1IF ==1)
    {
        singleShuntParam.adcSamplePoint = 0;
        IFS4bits.PWM1IF = 0;
    }    
    /* If single shunt algorithm is enabled, two ADC interrupts will be
     serviced every PWM period in order to sample current twice and
     be able to reconstruct the three phases */

    switch(singleShuntParam.adcSamplePoint)
    {
        case SS_SAMPLE_BUS1:
            /*Set Trigger to measure BusCurrent Second sample during PWM 
              Timer is counting up*/
            singleShuntParam.adcSamplePoint = 1;  
            /* Ibus is measured and offset removed from measurement*/
            singleShuntParam.Ibus1 = (int16_t)(ADCBUF_INV_A_IBUS) - 
                                            measureInputs.current.offsetIbus;                        
        break;

        case SS_SAMPLE_BUS2:
            /*Set Trigger to measure BusCurrent first sample during PWM 
              Timer is counting up*/
            INVERTERA_PWM_TRIGA = ADC_SAMPLING_POINT;
            singleShuntParam.adcSamplePoint = 0;
            /* this interrupt corresponds to the second trigger and 
                save second current measured*/
            /* Ibus is measured and offset removed from measurement*/
            singleShuntParam.Ibus2 = (int16_t)(ADCBUF_INV_A_IBUS) - 
                                            measureInputs.current.offsetIbus;
            ADCON3Lbits.SWCTRG = 1;
        break;

        default:
        break;  
    }
#endif
    //Iterate the ISR counter based each time we enter
    ISRCounter++;
    //Measure inputs from ADC and calibrate based on offsets
    measureInputs.current.Ia = ADCBUF_INV_A_IPHASE1;
    measureInputs.current.Ib = ADCBUF_INV_A_IPHASE2; 
    measureInputs.current.Ic = ADCBUF_INV_A_IPHASE3;
    measureInputs.current.Ibusext = ADCBUF_INV_A_IBUS_EXT;
    measureInputs.current.Ibus = ADCBUF_INV_A_IBUS; 
    
    
    MCAPP_MeasureCurrentCalibrate(&measureInputs);
    //Increment the current
    
    measureInputs.current.sumIbusext+=measureInputs.current.Ibusext;
    
        
    if (uGF.bits.MotorState!=0b11)
    {
        
        iabc.a = measureInputs.current.Ia;
        iabc.b = measureInputs.current.Ib;

        /* Calculate qId,qIq from qSin,qCos,qIa,qIb */
        MC_TransformClarke_Assembly(&iabc,&ialphabeta);
        MC_TransformPark_Assembly(&ialphabeta,&sincosTheta,&idq);
        /* Calculate control values */
        DoControl();
       
        /* Calculate qAngle */
        CalculateParkAngle();

        mcappData.periodStateVar+= (((long int)mcappData.period - 
                (long int)mcappData.periodFilter)*(int)(mcappData.PeriodKFilter));
        
        mcappData.periodFilter = (int)(mcappData.periodStateVar>>15);
        
