liamsabs/ECE499-buoyancy-energy-storage-system/ece499-dspic33ck/hall-sensor-based-foc-dspic33ck256mp508-lvmc/pmsm.c
        /* State Processing Logic */
        if (system.state == IDLE || system.state == GENERATING) {

            system.state = STORING; // set state to storing 

            /* Begin Motor Spinning */
            ResetParmeters();
            uGF.bits.MotorState = 0b01;
            EnablePWMOutputsInverterAMotor();

        } else if (system.state == PAUSED) {

            if (system.unpausedState == IDLE || system.unpausedState == STORING || system.unpausedState == GENERATING) {

                system.state = STORING; // set state to storing 

                /* Begin Motor Spinning */
                ResetParmeters();
                uGF.bits.MotorState = 0b01;
                EnablePWMOutputsInverterAMotor();
                if (system.unpausedState != IDLE) {
                    /* TODO: Unlock System */
                }

            } else if (system.unpausedState == STORED) {
                system.state = STORED; // Motor has no place to go, set back to stored
            }
        } 

    } else if (rxBuffer == 0x02) { // generate 

        /* State Processing Logic */
        if (system.state == STORING || system.state == STORED) {

            system.state = GENERATING; // set state to generating 

            /* Begin Motor Spinning */
            ResetParmeters();
            uGF.bits.MotorState = 0b10;
            EnablePWMOutputsInverterAGenerator();

            SPI1BUFL = 0;

        } else if (system.state == PAUSED) {

            if (system.unpausedState == IDLE) {

                system.state = IDLE;

            } else {
                system.state = GENERATING; // set state to generating 

                /* Begin Motor Spinning */
                ResetParmeters();
                uGF.bits.MotorState = 0b10;
                EnablePWMOutputsInverterAGenerator();
            }


        }   

    } else if (rxBuffer == 0x03) { // pause

        /* State Processing Logic */
        if (system.state != PAUSED) { // if IDLE or STORED, simply store state and pause

            if (system.state == STORING || system.state == GENERATING) {
                ResetParmeters(); // Stop the motor, reset motor parameters
                /* TODO: Engage Locking Mechanism */
            }
            system.unpausedState = system.state;
            system.state = PAUSED; 

        } else {
            if (system.unpausedState == STORING) {

                system.state = STORING; // set back to storing

                /* Begin Motor Spinning */
                ResetParmeters();
                uGF.bits.MotorState = 0b01;
                EnablePWMOutputsInverterAMotor();
                /* TODO: Unlock mechanism */

            } else if (system.unpausedState == GENERATING) {

                system.state = GENERATING; // set back to generating

                /* Begin Motor Spinning */
                ResetParmeters();
                uGF.bits.MotorState = 0b10;
                EnablePWMOutputsInverterAGenerator();
                /* TODO: Unlock mechanism */
            } else {
                system.state = system.unpausedState;
            }
        }       

    }
}

// *****************************************************************************
/* Function:
 prepareTxData(void)

  Summary:
    Loads Transmit buffer with bus voltage, bus current, and system state

  Description:
 loads array of size SPI_TX_BUFFER_SIZE into txBuffer 
 
  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */

void prepareTxData(void){

    //load bus voltage into transmit buffer
    txBuffer[0] = (uint8_t)(measureInputs.dcBusVoltage  >> 8)&0xFF;
    txBuffer[1] = (uint8_t)(measureInputs.dcBusVoltage&0xFF);
        
    //load bus current into transmit buffer, this is an averaging of all the currents measured
    int16_t IbusSend=__builtin_divsd(measureInputs.current.sumIbusext,ISRCounter)-measureInputs.current.offsetIbusext;
    //Reset the current and offset counter
    measureInputs.current.sumIbusext=0;
    ISRCounter=0;
    txBuffer[2] = (IbusSend >> 8)&0xFF;
    txBuffer[3] = (IbusSend)&0xFF;
        
    //load system state into transmit buffer
    txBuffer[4] = (uint8_t)system.state&0xFF;
    
    //Prepare the motor position as a percentage
    uint32_t Pos = __builtin_mulss(100,system.position);
    Pos = __builtin_divud(Pos, STORING_DONE_POS );
    txBuffer[5] = (uint8_t)Pos&0xFF;
    
}


// *****************************************************************************
/* Function:
    CalculateParkAngle ()

  Summary:
    Function calculates the angle for open loop control

  Description:
    Generate the start sine waves feeding the motor terminals
    Open loop control, forcing the motor to align and to start speeding up .
 
  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void CalculateParkAngle(void)
{
    /* if open loop */
    if (uGF.bits.OpenLoop)
    {
        /* begin with the lock sequence, for field alignment */
        if (motorStartUpData.startupLock < LOCK_TIME)
        {
            motorStartUpData.startupLock += 1;
        }
        /* Then ramp up till the end speed */
        else if (motorStartUpData.startupRamp < END_SPEED_RPM)
        {
            motorStartUpData.startupRamp += OPENLOOP_RAMPSPEED_INCREASERATE;
        }
        /* Switch to closed loop */
        else 
        {
                #ifndef OPEN_LOOP_FUNCTIONING
                    uGF.bits.ChangeMode = 1;
                    uGF.bits.OpenLoop = 0;
                #endif
            }
        /* The angle set depends on startup ramp */
        thetaElectricalOpenLoop = sectorToAngle[mcappData.sector];
        mcappData.HallTheta = thetaElectricalOpenLoop;
    }
}
// *****************************************************************************
/* Function:
    InitControlParameters()

  Summary:
    Function initializes control parameters

  Description:
    Initialize control parameters: PI coefficients, scaling constants etc.

  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void InitControlParameters(void)
{
    
    ctrlParm.qRefRamp = SPEEDREFRAMP;
    ctrlParm.speedRampCount = SPEEDREFRAMP_COUNT;
    /* Set PWM period to Loop Time */
    pwmPeriod = LOOPTIME_TCY;
 
    /* PI - Id Current Control */
    piInputId.piState.kp = D_CURRCNTR_PTERM;
    piInputId.piState.ki = D_CURRCNTR_ITERM;
    piInputId.piState.kc = D_CURRCNTR_CTERM;
    piInputId.piState.outMax = D_CURRCNTR_OUTMAX;
    piInputId.piState.outMin = -piInputId.piState.outMax;
    piInputId.piState.integrator = 0;
    piOutputId.out = 0;

    /* PI - Iq Current Control */
    piInputIq.piState.kp = Q_CURRCNTR_PTERM;
    piInputIq.piState.ki = Q_CURRCNTR_ITERM;
    piInputIq.piState.kc = Q_CURRCNTR_CTERM;
    piInputIq.piState.outMax = Q_CURRCNTR_OUTMAX;
    piInputIq.piState.outMin = -piInputIq.piState.outMax;
    piInputIq.piState.integrator = 0;
    piOutputIq.out = 0;

    /* PI - Speed Control */
    piInputOmega.piState.kp = SPEEDCNTR_PTERM;
    piInputOmega.piState.ki = SPEEDCNTR_ITERM;
    piInputOmega.piState.kc = SPEEDCNTR_CTERM;
    piInputOmega.piState.outMax = SPEEDCNTR_OUTMAX;
    piInputOmega.piState.outMin = -piInputOmega.piState.outMax;
    piInputOmega.piState.integrator = 0;
    piOutputOmega.out = 0;
}

void __attribute__((__interrupt__,no_auto_psv)) _PWMInterrupt()
{
    ResetParmeters();
    ClearPWMPCIFaultInverterA();
    LED1 = 1; 
    ClearPWMIF(); 
}
